### string

**存储一个string**
`set key value`

**获取一个string**
`get key value`

**获取字符串的一部分getrange**
字符串的截取范围由 start 和 end 两个偏移量决定(包括 start 和 end 在内)

```redis
set username 'zhangsan'
ok

get username
zhangsan

getrange username 0 3
zhan

getrange username 0 -1
zhangsan

```

**getset key 设置一个新的值,并且返回旧值**
返回给定 key 的旧值。 当 key 没有旧值时，即 key 不存在时，返回 nil(**测试发现不是返回nil 而是一个错误**) 。
当 key 存在但不是字符串类型时，返回一个错误。

```redis
get username
zhangsan

get name
nil

getset name
(error) wrong number of arguments (given 1, expected 2)

getset username 'lisi'
zhangsan

get username
lisi

getset sfsfsdfs
(error) wrong number of arguments (given 1, expected 2)
```

**setbit命令用于对 key 所储存的字符串值，设置或清除指定偏移量上的位(bit)**
```redis
redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1

redis> GETBIT bit 100   # bit 默认被初始化为 0
(integer) 0
```
**getbit命令用于对 key 所储存的字符串值，获取指定偏移量上的位(bit)**
```redis
redis> EXISTS bit
(integer) 0

redis> GETBIT bit 10086
(integer) 0


# 对已存在的 offset 进行 GETBIT

redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1
```

**Mget 获取一个或多个key对应的值**
命令返回所有(一个或多个)给定 key 的值。 如果给定的 key 里面，有某个 key 不存在，那么这个 key 返回特殊值 nil 

```redis
set username zhangsan
ok

set name lisi
ok

mget username name
1) "zhangsan"
2) "lisi"

mget username name othername
1) "zhangsan"
2) "lisi"
3) (nil)


```

**setex设置一个值并且设置它的过期时间(单位秒)**
`setex key_name timeout value`
命令为指定的 key 设置值及其过期时间。如果 key 已经存在， SETEX 命令将会替换旧的值。

```redis
set username zhangsan
ok

setex username 5 lisi
ok

get username
lisi

ttl username
3

get username
nil

```

**setnx 只有当key不存在时才能设置其值**
`setnx key_name value`
```redis
set username zhangsan
ok

set username lisi
ok

exists name
0

setnx name 'this is value'
1

setnx name 'this is value'
0

exists name
1

```

**覆盖(部分)字符串, 拼接字符串**
`SETRANGE KEY_NAME OFFSET VALUE`

```redis
set username zhangsan
ok

get username
zhangsan

setrange username 0 'he name called'

get username
he name called

setrange username 14 ' zhangsan'
he name called zhangsan

```