### string

**存储一个string**
`set key value`

**获取一个string**
`get key value`

**获取字符串的一部分getrange**
字符串的截取范围由 start 和 end 两个偏移量决定(包括 start 和 end 在内)

```redis
set username 'zhangsan'
ok

get username
zhangsan

getrange username 0 3
zhan

getrange username 0 -1
zhangsan

```

**getset key 设置一个新的值,并且返回旧值**
返回给定 key 的旧值。 当 key 没有旧值时，即 key 不存在时，返回 nil(**测试发现不是返回nil 而是一个错误**) 。
当 key 存在但不是字符串类型时，返回一个错误。

```redis
get username
zhangsan

get name
nil

getset name
(error) wrong number of arguments (given 1, expected 2)

getset username 'lisi'
zhangsan

get username
lisi

getset sfsfsdfs
(error) wrong number of arguments (given 1, expected 2)
```

**setbit命令用于对 key 所储存的字符串值，设置或清除指定偏移量上的位(bit)**
```redis
redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1

redis> GETBIT bit 100   # bit 默认被初始化为 0
(integer) 0
```
**getbit命令用于对 key 所储存的字符串值，获取指定偏移量上的位(bit)**
```redis
redis> EXISTS bit
(integer) 0

redis> GETBIT bit 10086
(integer) 0


# 对已存在的 offset 进行 GETBIT

redis> SETBIT bit 10086 1
(integer) 0

redis> GETBIT bit 10086
(integer) 1
```
**mset 设置多个值**
`mset key1 value1 key2 value2`
```redis
mset name1 'zhangsan' name2 'lisi' name3 'wangwu'
ok

keys *
1) "name3"
2) "name1"
3) "name2"

mget name1 name2 name3
1) "zhangsan"
2) "lisi"
3) "wangwu"

```

**msetnx设置多个key对应的值,但只有当key不存在时才能设置**
原子操作,要成功都成功,要失败都失败
`msetnx key1 value1 key2 value2`
```redis
msetnx name 'zhangsan' name2 'lisi'
1

msetnx name 'wangwu' name3 'lisi'
0

get name
zhangsan

get name3
nil

```

**Mget 获取一个或多个key对应的值**
命令返回所有(一个或多个)给定 key 的值。 如果给定的 key 里面，有某个 key 不存在，那么这个 key 返回特殊值 nil 

```redis
set username zhangsan
ok

set name lisi
ok

mget username name
1) "zhangsan"
2) "lisi"

mget username name othername
1) "zhangsan"
2) "lisi"
3) (nil)


```

**setex设置一个值并且设置它的过期时间(单位秒)**
`setex key_name timeout value`
命令为指定的 key 设置值及其过期时间。如果 key 已经存在， SETEX 命令将会替换旧的值。

```redis
set username zhangsan
ok

setex username 5 lisi
ok

get username
lisi

ttl username
3

get username
nil

```

**psetex设置一个值并且设置它的过期时间(单位毫秒)**
`psetex key_name timeout value`
```redis
psetex username 10000 zhangsan
ok

get username
zhangsan

pttl username
6458

ttl username
4

```

**setnx 只有当key不存在时才能设置其值**
`setnx key_name value`
```redis
set username zhangsan
ok

set username lisi
ok

exists name
0

setnx name 'this is value'
1

setnx name 'this is value'
0

exists name
1

```

**覆盖(部分)字符串, 拼接字符串**
`SETRANGE KEY_NAME OFFSET VALUE`

```redis
set username zhangsan
ok

get username
zhangsan

setrange username 0 'he name called'

get username
he name called

setrange username 14 ' zhangsan'
he name called zhangsan

```

**获取存储字符串值的长度strlen**
如果key不存在则返回0
`strlen key_name`
```redis
get name
nil

strlen name
0

set username zhangsan
ok

get username
zhangsan

strlen username
8
```

**incr数值类型的值加一,并返回**
如果key不存在,则初始化为0,再加1
如果key对应的值是非数值类型的,则返回一个错误
`incr key_name`
```redis
incr not_found
1

get not_found
1

psetex num 10000 10
ok

get num
10

incr num
11

get num
11

setex username 20 zhangsan
ok

get username
zhangsan

incr username
(error) ERR value is not an integer or out of range
```

**incrby为数值类型的值+指定的数值,并返回结果**
和 `incr`类似
当key不存在时,先初始化为0在+指定的值
当key不是数值类型时,返回错误
`incrby key_name`
```redis
setex num 10 10
ok

get num
10

incrby num 20
30

```

**decr数值类型减一**
如果 key 不存在，那么 key 的值会先被初始化为 0 ，然后再执行 DECR 操作。
如果值包含错误的类型，或字符串类型的值不能表示为数字，那么返回一个错误。
`decr key_name`
```redis

decr not_found
-1

get not_found
-1

setex num 20 10
ok

get num
10

decr num
9

setex username 20 'zhangsan'
ok

get username
zhangsan

decr username
(error) ERR value is not an integer or out of range

```

**decrby为数值类型的值-指定的数值,并返回结果**
和`decr`类似
如果 key 不存在，那么 key 的值会先被初始化为 0 ，然后再执行 DECRBY 操作。
如果值包含错误的类型，或字符串类型的值不能表示为数字，那么返回一个错误。
`decr key_name num`
```redis
setex num 20 10
ok

decrby num 4
6

```
**append字符串的相加功能(返回添加后的字符串长度)**
如果 key 已经存在并且是一个字符串， APPEND 命令将 value 追加到 key 原来的值的末尾
如果 key 不存在， APPEND 就简单地将给定 key 设为 value ，就像执行 SET key value 一样。

`append key_name value`
```redis
append name lisi
4

get name
lisi

setex username 20 zhangsan
ok

get username
zhangsan

append username ' ni hao'
15

get username
zhangsan ni hao

```



